---
kind: property
id: P:Autodesk.Revit.ApplicationServices.ControlledApplication.Language
source: html/1acafee6-95e0-50dd-2e46-8951e9405311.htm
---
# Autodesk.Revit.ApplicationServices.ControlledApplication.Language Property

The language used in the current session of Revit.

## Syntax (C#)
```csharp
public LanguageType Language { get; }
```

## Remarks
Use this property to determine the language used by Revit; this can allow your application to load the appropriate resources.